---
kind: other
id: Properties.T:Autodesk.Revit.DB.OrdinateDimensionSetting
source: html/c90ad496-0f4c-072b-2976-90bd636fa112.htm
---
# OrdinateDimensionSetting Properties

Specifies the dimension line segment length. This setting is enabled when Dimension Line Style is Segmented.